test/request-response-samples/validateDeviceInfo__appsim_fault_response/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:soapHeader="http://www.ee.co.uk/common/message/SoapHeader/v1.0" xmlns:fault="http://www.ee.co.uk/common/message/FaultMessage/v1.0" xmlns:req="http://www.ee.co.uk/external/apple/service/AppleSim/AppleSimRequest/v1" xmlns:res="http://www.ee.co.uk/external/apple/service/AppleSim/AppleSimResponse/v1" xmlns:tns="http://www.ee.co.uk/external/apple/service/AppleSim/v1" xmlns:ns="http://messaging.ei.tmobile.net/datatypes" xmlns:ns1="http://www.ee.co.uk/common/message/Fault/v1.0" xmlns:ns2="http://www.ee.co.uk/common/message/Notifications/v1.0" xmlns:ns3="http://www.ee.co.uk/common/message/Request/v1.0" xmlns:ns4="http://www.ee.co.uk/common/message/Response/v1.0" xmlns:ns5="http://www.ee.co.uk/common/message/ResponseMessage/v1.0" xmlns:ns8="http://www.ee.co.uk/common/message/BusinessException/v1.0" xmlns:ns9="http://www.ee.co.uk/common/message/TechnicalException/v1.0" xmlns:busex="http://www.ee.co.uk/common/message/BusinessException/v1.0" xmlns:techex="http://www.ee.co.uk/common/message/TechnicalException/v1.0"><soap:Body><req:validateDeviceInfo xmlns:req="http://www.ee.co.uk/external/apple/service/AppleSim/AppleSimRequest/v1"><message><equipment><csn>ts182_Ipad_csn</csn></equipment></message></req:validateDeviceInfo></soap:Body></soap:Envelope>